<a href="https://colab.research.google.com/github/rodrigowe1988/Alura-Data-Science/blob/main/Python_Pandas_Tratando_e_analisando_dados_aula_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Relatório de Análise I

In [1]:
#importando o pandas
import pandas as pd

In [4]:
#carregando a base de dados dentro da variável 'dados'
dados = pd.read_csv('aluguel.csv', sep=';')
dados.head()

                      Tipo           Bairro  ...  Condominio    IPTU
0                Quitinete       Copacabana  ...       500.0    60.0
1                     Casa  Jardim Botânico  ...         NaN     NaN
2  Conjunto Comercial/Sala  Barra da Tijuca  ...      4020.0  1111.0
3              Apartamento           Centro  ...       390.0    20.0
4              Apartamento     Higienópolis  ...       230.0     NaN

[5 rows x 9 columns]

In [6]:
#número de linhas e colunas do dataframe
dados.shape

(32960, 9)

In [23]:
#para deixar mais apresentável essa informação podemos 'printar'
print(f'O dataframe que estamos utilizando possui {dados.shape[0]} linhas e \
{dados.shape[1]} colunas.')

O dataframe que estamos utilizando possui 32960 linhas e 9 colunas.

In [8]:
type(dados)

pandas.core.frame.DataFrame

Tipo da variável __dados__ é DataFrame.

In [9]:
dados.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32960 entries, 0 to 32959
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Tipo        32960 non-null  object
 1   Bairro      32960 non-null  object
 2   Quartos     32960 non-null  int64
 3   Vagas       32960 non-null  int64
 4   Suites      32960 non-null  int64
 5   Area        32960 non-null  int64
 6   Valor       32943 non-null  float64
 7   Condominio  28867 non-null  float64
 8   IPTU        22723 non-null  float64
dtypes: float64(3), int64(4), object(2)
memory usage: 2.3+ MB

### O método dtypes() exibe apenas os tipos de variáveis, então se escrevermos:

In [10]:
dados.dtypes

Tipo           object
Bairro         object
Quartos         int64
Vagas           int64
Suites          int64
Area            int64
Valor         float64
Condominio    float64
IPTU          float64
dtype: object

In [19]:
dados_dtypes = pd.DataFrame(dados.dtypes)
dados_dtypes.columns = ['Tipo de Dado']
dados_dtypes.columns.name = 'Variável'
dados_dtypes

Variável   Tipo de Dado
Tipo             object
Bairro           object
Quartos           int64
Vagas             int64
Suites            int64
Area              int64
Valor           float64
Condominio      float64
IPTU            float64